# Concatenating Pandas DataFrames

## 1. Import Libraries and Dependencies

In [9]:
# Import libraries and dependencies
import pandas as pd

## 2. Create a Path to the File Using Pathlib.

In [4]:
# Import data
from pathlib import Path

## 3. Read the CSV into a Pandas DataFrame.

In [14]:
# Read the CSVs into DataFrames
MSFT_path = Path('../Resources/MSFT.csv')
SP500_path = Path('../Resources/SP500.csv')

# Read in data and index by date
MSFT_data = pd.read_csv(MSFT_path)
SP500_data = pd.read_csv(SP500_path)
#why is date column not working?

## 4. Preview MSFT DataFrame

In [13]:
# Display a few rows of the MSFT DataFrame
MSFT_data.head()

     date  close    volume   open   high    low
0  8/3/09  23.83  46843710  23.82  23.86  23.50
1  8/4/09  23.77  49116380  23.68  23.79  23.53
2  8/5/09  23.81  53263040  23.84  24.25  23.79
3  8/6/09  23.46  59655950  23.93  23.98  23.27
4  8/7/09  23.56  46165010  23.75  23.82  23.50

## 5. Preview SP500 DataFrame

In [15]:
# Display a few rows of the SP500 DataFrame
SP500_data.head()

      date        close
0  5/20/14  1872.829956
1  5/21/14  1888.030029
2  5/22/14  1892.489990
3  5/23/14  1900.530029
4  5/27/14  1911.910034

## 6. Concatenate Data by Columns Using `concat` Function and `inner` Join

In [17]:
# Concatenate the two DataFrames by columns and perform an inner join
concat_columns_df = pd.concat([MSFT_data, SP500_data], axis="columns", join="inner")
concat_columns_df.head()

     date  close    volume   open   high    low     date        close
0  8/3/09  23.83  46843710  23.82  23.86  23.50  5/20/14  1872.829956
1  8/4/09  23.77  49116380  23.68  23.79  23.53  5/21/14  1888.030029
2  8/5/09  23.81  53263040  23.84  24.25  23.79  5/22/14  1892.489990
3  8/6/09  23.46  59655950  23.93  23.98  23.27  5/23/14  1900.530029
4  8/7/09  23.56  46165010  23.75  23.82  23.50  5/27/14  1911.910034

## 7. Concatenate Data by Row Using `concat` Function and `inner` Join

In [20]:
# Concatenate the two DataFrames by rows and perform an inner join
concat_rows_df = pd.concat([MSFT_data, SP500_data], axis="rows", join="inner")
concat_rows_df.head()
#concat_rows_df.tail()

     date  close
0  8/3/09  23.83
1  8/4/09  23.77
2  8/5/09  23.81
3  8/6/09  23.46
4  8/7/09  23.56